---
kind: type
id: T:Autodesk.Revit.DB.RevisionNumbering
source: html/d7bfff7e-ddf0-990d-656e-229f5219bc80.htm
---
# Autodesk.Revit.DB.RevisionNumbering

The options for how revision numbers should be displayed on sheets within a project.

## Syntax (C#)
```csharp
public enum RevisionNumbering
```